/*==========================================================================
  == 哔哩哔哩ID：620162563                                                ===
  ==========================================================================
*/

#include <Arduino.h>

#define PWM_CHANNEL 0   // 定义PWM通道，ESP32有多个PWM通道可用
#define PWM_PIN 14      // 定义连接电机的引脚，根据实际连接调整

void setupPWM() {
    ledcSetup(PWM_CHANNEL, 20000, 8);     // 设置PWM通道，频率和分辨率
    ledcAttachPin(PWM_PIN, PWM_CHANNEL);  // 将PWM通道连接到指定的引脚
    ledcWrite(PWM_CHANNEL, 0);            // 初始占空比为0，电机停止
}


////======================================================////
/*
通道（0~15）      16个PWM通道
频率（Hz）        50Hz~20kHz
分辨率（位数）    8位 = 0~255  256级调速  调速精度
*/
////======================================================////
